papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/beamInCrossFlow.Richter2012/quasiMonolithic/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidModel    nonLinearGeometryTotalLagrangianVelocity;

nonLinearGeometryTotalLagrangianVelocityCoeffs
{
    linearElasticFormulation yes;
    // E           E [1 -1 -2 0 0 0 0] 1.4e6;
    // nu          nu [0 0 0 0 0 0 0] 0.4;
    mu           mu [1 -1 -2 0 0 0 0] 500000;
    lambda       lambda [1 -1 -2 0 0 0 0] 2000000;

    //futureForceFraction 0.5;

    dampingCoeff [0 0 -1 0 0 0 0] 1e4;
}


// ************************************************************************* //
